research/reversalBreakout.org
#+TITLE:
Research on Reversal Breakouts
#+description: document to work through what I can find out about when reversal breakouts happen
#+startup: hideblocks

* Index
Here is a small little index of what the codes in the system are.
** Fields and what they correspond to
| Field No. | What is contained                                                                |
|-----------+----------------------------------------------------------------------------------|
|         1 | What Timeframe is this move on?                                                  |
|         2 | Time of move                                                                     |
|         3 | Higher Timeframe move this move is in                                            |
|         4 | Direction in Relation to Higher Timeframe move                                   |
|         5 | Previous move on this Timeframe                                                  |
|         6 | Did the previous move undershoot or overshoot?                                   |
|         7 | Line the previous move on this Timeframe started from                            |
|         8 | What is this move?                                                               |
|         9 | What line did it start from?                                                     |
|        10 | Did this move undershoot or overshoot?                                           |
|        11 | How did the beginning of this move reverse from the Lower Timeframe Perspective? |
|        12 | Any notes?                                                                       |
** Shortcodes
So through out the tables and probably when witing I am gonna refer to stuff in short code like HTF and LTF. This means stuff and it just allows me to write less and conserve space on the screen. Here is a little cheat sheet for that.
| Shortcode      | Long Version                                                                                     |
|----------------+--------------------------------------------------------------------------------------------------|
| TF             | Time Frame                                                                                       |
| TTF            | Trading Timeframe                                                                                |
| HTF            | Higher Timeframe                                                                                 |
| LTF            | Lower Timeframe                                                                                  |
| F(38, 50, 61)% | Fibonnaci Level (with associated percentage)                                                     |
| R              | Reversal move                                                                                    |
| RB             | Reversal Breakout Move                                                                           |
| OM             | Opposite Move                                                                                    |
| WM             | With Move, direction of TTF move in relation to HTF move                                         |
| WM-FM          | With Move - First Move, same as above but is the first move in the new HTF move                  |
| S/R            | Support or Resistance                                                                            |
| SS             | Support - Said without any Timeframe prefix means it is on Trading Timeframe                     |
| RR             | Resistance  - Said without any Timeframe prefix means it is on Trading Timeframe                 |
| OS             | One Swing                                                                                        |
| DT             | Double Top                                                                                       |
| HDT            | Half Double Top - when the second top is a fib move                                              |
| QDT            | Quarter Double Top - when the first top leads to a reversal and the second top is a fib          |
| DB             | Double Bottom                                                                                    |
| HDB            | Half Double Bottom - when the second Bottom is a fib move                                        |
| QDB            | Quarter Double Bottom - when the first Bottom leads to a reversal and the second Bottom is a fib |
** Conclusion Format
When thinking of a format in which to collect the puzzle pieces, one sort of format that I think might help is this:
1. Summarize what it is that you have found
2. How, if it does at all, fit in with what i'm looking for?
3. If it does not fit into what I am looking for, where do I think it can fit into?
4. Further possible "puzzle pieces" that I can look into after knowing this one

