research/reversalBreakout.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-13 Fri 15:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
<meta name="description" content="document to work through what I can find out about when reversal breakouts happen"
 />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee1e288">1. Index</a>
<ul>
<li><a href="#org42c3abe">1.1. Fields and what they correspond to</a></li>
<li><a href="#org56f2f51">1.2. Shortcodes</a></li>
<li><a href="#orgd6f7176">1.3. Conclusion Format</a></li>
</ul>
</li>
<li><a href="#org9237fbf">2. Introduction</a></li>
<li><a href="#org897bb97">3. Edit Notes</a></li>
<li><a href="#org471009a">4. Rough Ideas</a></li>
<li><a href="#org9afa79c">5. Simple Comparisons</a>
<ul>
<li><a href="#org8ab520d">5.1. HTF move this move is in</a>
<ul>
<li><a href="#org7e643d6">5.1.1. Splits</a></li>
</ul>
</li>
<li><a href="#org3719e4c">5.2. Direction in relation to HTF move</a>
<ul>
<li><a href="#orgabbbb35">5.2.1. Splits</a></li>
</ul>
</li>
<li><a href="#org47bc9ea">5.3. Previous move on this TF</a>
<ul>
<li><a href="#org8739339">5.3.1. Splits</a></li>
</ul>
</li>
<li><a href="#org7678f6d">5.4. Line the previous move started from</a>
<ul>
<li><a href="#orgc10286a">5.4.1. Splits</a></li>
</ul>
</li>
<li><a href="#org3ea929a">5.5. Did previous move overshoot or undershoot</a>
<ul>
<li><a href="#orgd9cb233">5.5.1. Splits</a></li>
</ul>
</li>
<li><a href="#orge1f5494">5.6. What line did this move start from</a>
<ul>
<li><a href="#orge431462">5.6.1. Splits</a></li>
</ul>
</li>
<li><a href="#orgcee6a3a">5.7. Did the start of this move overshoot or undershoot</a>
<ul>
<li><a href="#orga32d5e7">5.7.1. Splits</a></li>
</ul>
</li>
<li><a href="#orgc1c82ce">5.8. How did the start of this move reverse on the LTF</a>
<ul>
<li><a href="#org25802e2">5.8.1. Splits</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Research on Reversal Breakouts
</p>

<div id="outline-container-orgee1e288" class="outline-2">
<h2 id="orgee1e288"><span class="section-number-2">1</span> Index</h2>
<div class="outline-text-2" id="text-1">
<p>
Here is a small little index of what the codes in the system are.
</p>
</div>
<div id="outline-container-org42c3abe" class="outline-3">
<h3 id="org42c3abe"><span class="section-number-3">1.1</span> Fields and what they correspond to</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Field No.</th>
<th scope="col" class="org-left">What is contained</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">What Timeframe is this move on?</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Time of move</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Higher Timeframe move this move is in</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Direction in Relation to Higher Timeframe move</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Previous move on this Timeframe</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Did the previous move undershoot or overshoot?</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Line the previous move on this Timeframe started from</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">What is this move?</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">What line did it start from?</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Did this move undershoot or overshoot?</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">How did the beginning of this move reverse from the Lower Timeframe Perspective?</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Any notes?</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org56f2f51" class="outline-3">
<h3 id="org56f2f51"><span class="section-number-3">1.2</span> Shortcodes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
So through out the tables and probably when witing I am gonna refer to stuff in short code like HTF and LTF. This means stuff and it just allows me to write less and conserve space on the screen. Here is a little cheat sheet for that.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcode</th>
<th scope="col" class="org-left">Long Version</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TF</td>
<td class="org-left">Time Frame</td>
</tr>

<tr>
<td class="org-left">TTF</td>
<td class="org-left">Trading Timeframe</td>
</tr>

<tr>
<td class="org-left">HTF</td>
<td class="org-left">Higher Timeframe</td>
</tr>

<tr>
<td class="org-left">LTF</td>
<td class="org-left">Lower Timeframe</td>
</tr>

<tr>
<td class="org-left">F(38, 50, 61)%</td>
<td class="org-left">Fibonnaci Level (with associated percentage)</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">Reversal move</td>
</tr>

<tr>
<td class="org-left">RB</td>
<td class="org-left">Reversal Breakout Move</td>
</tr>

<tr>
<td class="org-left">OM</td>
<td class="org-left">Opposite Move</td>
</tr>

<tr>
<td class="org-left">WM</td>
<td class="org-left">With Move, direction of TTF move in relation to HTF move</td>
</tr>

<tr>
<td class="org-left">WM-FM</td>
<td class="org-left">With Move - First Move, same as above but is the first move in the new HTF move</td>
</tr>

<tr>
<td class="org-left">S/R</td>
<td class="org-left">Support or Resistance</td>
</tr>

<tr>
<td class="org-left">SS</td>
<td class="org-left">Support - Said without any Timeframe prefix means it is on Trading Timeframe</td>
</tr>

<tr>
<td class="org-left">RR</td>
<td class="org-left">Resistance  - Said without any Timeframe prefix means it is on Trading Timeframe</td>
</tr>

<tr>
<td class="org-left">OS</td>
<td class="org-left">One Swing</td>
</tr>

<tr>
<td class="org-left">DT</td>
<td class="org-left">Double Top</td>
</tr>

<tr>
<td class="org-left">HDT</td>
<td class="org-left">Half Double Top - when the second top is a fib move</td>
</tr>

<tr>
<td class="org-left">QDT</td>
<td class="org-left">Quarter Double Top - when the first top leads to a reversal and the second top is a fib</td>
</tr>

<tr>
<td class="org-left">DB</td>
<td class="org-left">Double Bottom</td>
</tr>

<tr>
<td class="org-left">HDB</td>
<td class="org-left">Half Double Bottom - when the second Bottom is a fib move</td>
</tr>

<tr>
<td class="org-left">QDB</td>
<td class="org-left">Quarter Double Bottom - when the first Bottom leads to a reversal and the second Bottom is a fib</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd6f7176" class="outline-3">
<h3 id="orgd6f7176"><span class="section-number-3">1.3</span> Conclusion Format</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When thinking of a format in which to collect the puzzle pieces, one sort of format that I think might help is this:
</p>
<ol class="org-ol">
<li>Summarize what it is that you have found</li>
<li>How, if it does at all, fit in with what i&rsquo;m looking for?</li>
<li>If it does not fit into what I am looking for, where do I think it can fit into?</li>
<li>Further possible &ldquo;puzzle pieces&rdquo; that I can look into after knowing this one</li>
</ol>
</div>
</div>
</div>
