research/reversalBreakout.org
* Introduction
This is the Document for trying to figure out when and why a reversal breakout move occurs. This is a move in which the new move breaks past the point of where the previous move started from on the chart. It is the move that is the strongest and if you are in the correct direction and riding the move, this move is the most profitable also.
I am not sure exactly how I will tackle this at the minute but I guess I will go along for the ride and see innit.

One thing however that as I was working through the document I thought up, what you are trying to do at the minute is a basically try and put together a puzzle piece almost of what can and cant go into certain places logically speaking.
When you are comparing stuff and analysing stuff one thing you need to keep in your head is that everything is basically binary in the sense that it either is the reason why stuff happens or it isn't. Or it does corelate to this thing you are trying to work our or it doesn't. Not having found the piece of the puzzle that fits into the piece you want it to is fine. You have still uncovered a piece of the puzzle that you probably didnt know was there in the first place and that piece is probably good for fitting in somewhere else, so keep it.

Basically binary. Does it help? Does it not? kl. If it does help for this particular thing you are looking for, not even directly mind you. It could fit into something that is correlated to the thing that you are looking for, for a rubbish example, in this document you are looking for RB moves and why and when you can know they happen however one thing you know is that RB only happen WM. Therefore if you have a puzzle piece that allows you to know something about WM or WM-FM then that in turn wil help you know about RB.

What I will be doing essentially then when I think about it is be collecting puzzle pieces to this "game". When I am looking for a particular thing a puzzle piece either will fit, directly that is, or wont. However that puzzle piece will probably fit into another puzzle piece or thing I am looking for, I have not ruled out that any puzzle piece I find will actually fit into something. I think some may not fit into anything. It is really input therefore to have a good catalogue of puzzle pieces. I am gonna try and put them under the conclusion section in anything I am doing so that I can easily distinguish them from general thinking in writing.
There is a small guide in the index.


Also just to know. I do not think it will be possible to know for every single move if it will be a RB or not but what I am hoping to practically achieve is to know when these moves are more liekly to occur, in what conditions, in both hindsight as well as foresight, in order to help me have a better chance of gettin it right. Basically stack the odds in my favour innit. But who knows where this journey will take me or how good I can be. Just need to put in time and correct actions and I may be pleasnatly surprised.

* Edit Notes
- As I was looking through the database on the day of 08-10-2020 I realized that I had made a mistake in some fields when I was doing HTF moves. When I wrote down wat line they started from I accidently added them as "HTF SS" or "HTF RR" instead of Just SS or RR. This mistake may mean that this day would not always be as accurate a representaion to the way I am defining stuff as It seems as the S/R it started from was actually a HHTF one. This would need to be manually changed by lookingat the chart and editing the database accordingly however that takes up time. I do not want to do that right now so just a heads up.
- I think I may need to add another category to my database for future reference. Basically knowing how the beginning of the move reversed is not only useful for the TTF but also for the HTF and I could also possibly at it for the HHTF also. It would be an interesting look at how it happened easily.
