research/reversalBreakout.org
* Rough Ideas
So I know that RB moves hapen only when It is with the HTF move and when the HTF is moving to a point taht is past the TTF S/R that is closer than the HTF S/R point. It is only basically when the HTF move is basically progressing past the point it has previously.
    Here is an output of the RB moves I have in the database so far.
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
     FS=","
     print "Move No\tTF of move\tThis move\tHTF move this move is in\tRelation to HTF move\tLine this move started from\t\n"
}
$8 ~ "RB" {print NR"\t"$1"\t"$8"\t"$3"\t"$4"\t"$9}
#+END_SRC
#+RESULTS:
| Move No | TF of move | This move | HTF move this move is in | Relation to HTF move | Line this move started from        |
|         |            |           |                          |                      |                                    |
|       2 | HHTF       | RB        | F61%                     | WM                   | HTF SS                             |
|       3 | HTF        | RB        | RB                       | WM                   | HTF SS/HHTF F38%                   |
|       4 | TTF        | RB        | RB                       | WM                   | SS                                 |
|      14 | TTF        | RB        | F61%                     | WM                   | RR                                 |
|      24 | HTF        | RB        | RB                       | WM-FM                | F61%                               |
|      25 | TTF        | RB        | RB                       | WM-FM                | HTF F61%/RR                        |
|      33 | TTF        | RB        | RB                       | WM                   | F61%                               |
|      35 | TTF        | RB        | RB                       | WM                   | F50%                               |
|      41 | TTF        | RB        | R                        | WM                   | HTF F50%/F50% - synonymous moves   |
|      44 | HTF        | RB        | RB                       | WM                   | RR/HHTF F23%                       |
|      45 | TTF        | RB        | RB                       | WM-FM                | RR                                 |
|      47 | TTF        | RB        | RB                       | WM                   | F61%                               |
|      52 | TTF        | RB        | F61%                     | OM                   | F38%                               |
|      53 | TTF        | RB        | F61%                     | WM                   | HTF F50%                           |
|      59 | TTF        | RB        | F50%                     | WM-FM                | RR/HTF RR/HTF F61%                 |
|      64 | HTF        | RB/R      | RB                       | WM                   | HTF F61%/HTF RR                    |
|      65 | TTF        | RB        | RB/R                     | WM-FM                | F61%                               |
|      69 | TTF        | RB        | RB/R                     | WM                   | RR                                 |
|      71 | HTF        | RB        | HHTF R                   | WM-FM                | HTF SS                             |
|      72 | TTF        | RB        | RB                       | WM-FM                | HTF SS                             |
|      82 | TTF        | RB        | F61%                     | WM-FM                | F61%                               |
|      88 | TTF        | RB        | R                        | WM                   | F61%                               |
|      94 | TTF        | RB        | RB                       | WM                   | SS/HTF F50%                        |
|      98 | TTF        | RB        | R                        | WM-FM                | RR                                 |
|     101 | HTF        | RB        | HHHTF R                  | WM                   | HTF SS                             |
|     102 | TTF        | RB        | RB                       | WM-FM                | F61%                               |
|     109 | TTF        | R/RB      | F50%                     | WM-FM                | SS/HTF SS                          |
|     112 | HTF        | RB        | HHHTF R                  | OM                   | F50%                               |
|     113 | TTF        | RB        | RB                       | WM-FM                | HTF F50%                           |
|     115 | TTF        | RB        | RB                       | WM                   | F50%                               |
|     116 | HTF        | R/RB      | HHHTF R                  | WM                   | HHTF F61%/HTF SS                   |
|     117 | TTF        | RB        | R/RB                     | WM-FM                | SS within HTF SS area at HHTF F61% |
|     121 | TTF        | RB        | F61%                     | WM-FM                | HTF RR                             |
|     122 | HTF        | RB        | HHHTF R                  | WM                   | F61%                               |
|     125 | TTF        | RB        | RB                       | WM                   | F50%                               |
So basically this is all the Reversal Breakout moves I have at the minute in this days database. Just to be clear this is the moves just from one days worth of movements. So not a lot but hopefully I can still get good enough data out of this.
What I know is that RB moves only really happen when the HTF move is breaking into a new low or high than it has done before on its current HTF move. Thats basiaclly it. So what I know is that this means that the RB move is intrinsically a WM in relation to the HTF move. THis is the case as You can see from the Table at the top.

Thats basically what I know for sure at the minute. Which is good only if I knew when that would happen. What will I do with figuring out when this move happens though? Well currently I have a days database of moves categorized into 12 fields. Thats what I have to work with. Some of the fields are categorizing price but not in a way that I think is helpful in figuring out when this move happens, such as the Time of move or any notes I have. That efectively leaves me with 10 fields basically. I guess what I basically have is at least one fixed variable, which is the RB move, and then have variable variables that can change. The whole point is trying to figure out what situation(s), there is probably more than one, would equal a RB move. It is not just me needing to know that a RB happens when this is the case that I need to find out but also I need to know when a RB "will" happen ,pre-emptively. Meaning I need to know that when these conditions are the case the next move will most likely be a RB move not just a RB move happens, past tense, when these things are the case.

I think a good first thing then is to do a simple comparison of my fixed variable of a RB move and every other variable I have in the table. See if there are any correlations and try and figure out if then I need to move on to more complex mixture of factors, such as a commonality between two variables. This can get quite complex especially when you look at all the different possibilities of mixtures that can happen with the current variables themselves let alone derving more complex variables. These complex variables will probably be needed when I am trying to find a preemptive cause for a RB move. Complex variables would be looking at past moves from the current move as well as looking at how those past moves mixed in terms of how many swings and what structure they made and in what context they made it in.
