research/reversalBreakout.html
<div id="outline-container-org471009a" class="outline-2">
<h2 id="org471009a"><span class="section-number-2">4</span> Rough Ideas</h2>
<div class="outline-text-2" id="text-4">
<p>
So I know that RB moves hapen only when It is with the HTF move and when the HTF is moving to a point taht is past the TTF S/R that is closer than the HTF S/R point. It is only basically when the HTF move is basically progressing past the point it has previously.
    Here is an output of the RB moves I have in the database so far.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">TF of move</td>
<td class="org-left">This move</td>
<td class="org-left">HTF move this move is in</td>
<td class="org-left">Relation to HTF move</td>
<td class="org-left">Line this move started from</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">HHTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">WM</td>
<td class="org-left">HTF SS</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">HTF SS/HHTF F38%</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">SS</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">WM</td>
<td class="org-left">RR</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">HTF F61%/RR</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
<td class="org-left">WM</td>
<td class="org-left">HTF F50%/F50% - synonymous moves</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">RR/HHTF F23%</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">RR</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">OM</td>
<td class="org-left">F38%</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">WM</td>
<td class="org-left">HTF F50%</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
<td class="org-left">WM-FM</td>
<td class="org-left">RR/HTF RR/HTF F61%</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">HTF</td>
<td class="org-left">RB/R</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">HTF F61%/HTF RR</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
<td class="org-left">WM-FM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
<td class="org-left">WM</td>
<td class="org-left">RR</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">HHTF R</td>
<td class="org-left">WM-FM</td>
<td class="org-left">HTF SS</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">HTF SS</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">WM-FM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
<td class="org-left">WM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">SS/HTF F50%</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
<td class="org-left">WM-FM</td>
<td class="org-left">RR</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
<td class="org-left">WM</td>
<td class="org-left">HTF SS</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">TTF</td>
<td class="org-left">R/RB</td>
<td class="org-left">F50%</td>
<td class="org-left">WM-FM</td>
<td class="org-left">SS/HTF SS</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
<td class="org-left">OM</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">HTF F50%</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">HTF</td>
<td class="org-left">R/RB</td>
<td class="org-left">HHHTF R</td>
<td class="org-left">WM</td>
<td class="org-left">HHTF F61%/HTF SS</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">R/RB</td>
<td class="org-left">WM-FM</td>
<td class="org-left">SS within HTF SS area at HHTF F61%</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
<td class="org-left">WM-FM</td>
<td class="org-left">HTF RR</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">HTF</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
<td class="org-left">WM</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">TTF</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
<td class="org-left">F50%</td>
</tr>
</tbody>
</table>
<p>
So basically this is all the Reversal Breakout moves I have at the minute in this days database. Just to be clear this is the moves just from one days worth of movements. So not a lot but hopefully I can still get good enough data out of this.
What I know is that RB moves only really happen when the HTF move is breaking into a new low or high than it has done before on its current HTF move. Thats basiaclly it. So what I know is that this means that the RB move is intrinsically a WM in relation to the HTF move. THis is the case as You can see from the Table at the top.
</p>

<p>
Thats basically what I know for sure at the minute. Which is good only if I knew when that would happen. What will I do with figuring out when this move happens though? Well currently I have a days database of moves categorized into 12 fields. Thats what I have to work with. Some of the fields are categorizing price but not in a way that I think is helpful in figuring out when this move happens, such as the Time of move or any notes I have. That efectively leaves me with 10 fields basically. I guess what I basically have is at least one fixed variable, which is the RB move, and then have variable variables that can change. The whole point is trying to figure out what situation(s), there is probably more than one, would equal a RB move. It is not just me needing to know that a RB happens when this is the case that I need to find out but also I need to know when a RB &ldquo;will&rdquo; happen ,pre-emptively. Meaning I need to know that when these conditions are the case the next move will most likely be a RB move not just a RB move happens, past tense, when these things are the case.
</p>

<p>
I think a good first thing then is to do a simple comparison of my fixed variable of a RB move and every other variable I have in the table. See if there are any correlations and try and figure out if then I need to move on to more complex mixture of factors, such as a commonality between two variables. This can get quite complex especially when you look at all the different possibilities of mixtures that can happen with the current variables themselves let alone derving more complex variables. These complex variables will probably be needed when I am trying to find a preemptive cause for a RB move. Complex variables would be looking at past moves from the current move as well as looking at how those past moves mixed in terms of how many swings and what structure they made and in what context they made it in.
</p>
</div>
</div>
