research/reversalBreakout.org
* Simple Comparisons
This section is going to have all of the simple comparisons of a RB move with the contents of all the other relevant fields. I wont have any other factors in this sections graphs apart from "this move" being a RB move as well and just showing all the data in another relevant field. Hopefully this section will help spot some helpful correlations, if any.
** HTF move this move is in
Having a RB happen on all the different types of HTF moves makes sense becasue when a new HTF move is made that means the trend on the TTF has to be reversed as a new HTF move will mean a new trend on the TTF most likely. And a trend is nothing more than a general movement in one direction with a series of higher highs and higher lows or lower highs and lower lows. Obviously this means that RB will occur as a given. What does tend to happen though when you look at the splits is that when the HTF move is in a RB itself or some sort of larger TF move, it gives teh TTF more opportunityto be able to make RB moves as the HTF is just a bigger move hence the TTF is a bigger trend with more RB moves. It would also make sense, I think, that When the HTF move is a RB move, the TTF moves will be larger in stature as they may have less of a close target or S/R to reach.

*Conclusion*
:Conclusion:
1. Gonna break down the conclusion

   - RB moves will happen in any HTF move type but more frequently in a RB HTF move it seems, or basically when the HHTF move is taking effect and the HTF move is synonymous with it
   - Basically a bigger HTF move means more of a trend for the TTF and therefore, possibly, more RB moves.

2. I know that when the HTF is only having a RB or a HHTF move then that would mean that there is more opportunity to have a RB trade on the TTF also.

3. At the minute I have just said that a RB move on the HTF chart will lead to RB moves on the TTF chart without knowing what causes an RB move and when to expect it except when an RB move happens. Thats some inception timey wimey stuff right there bruv!

4. I think one thing that I can look into after thinking about this is what lines the RB move started from and what about the lines of the TF above it as well. Moves are classified basically because of what lines they abide by so another way to look at it is im trying to find out which lines will stop a move so it seems right to see which lines actually do. Especially in the conetxt of the HTF.
:END:

#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHTF move this move is in"
}
$8 ~ "RB" {print NR"\t"$8"\t"$3}
#+END_SRC
#+RESULTS:
| Move No | This move | HTF move this move is in |
|       2 | RB        | F61%                     |
|       3 | RB        | RB                       |
|       4 | RB        | RB                       |
|      14 | RB        | F61%                     |
|      24 | RB        | RB                       |
|      25 | RB        | RB                       |
|      33 | RB        | RB                       |
|      35 | RB        | RB                       |
|      41 | RB        | R                        |
|      44 | RB        | RB                       |
|      45 | RB        | RB                       |
|      47 | RB        | RB                       |
|      52 | RB        | F61%                     |
|      53 | RB        | F61%                     |
|      59 | RB        | F50%                     |
|      64 | RB/R      | RB                       |
|      65 | RB        | RB/R                     |
|      69 | RB        | RB/R                     |
|      71 | RB        | HHTF R                   |
|      72 | RB        | RB                       |
|      82 | RB        | F61%                     |
|      88 | RB        | R                        |
|      94 | RB        | RB                       |
|      98 | RB        | R                        |
|     101 | RB        | HHHTF R                  |
|     102 | RB        | RB                       |
|     109 | R/RB      | F50%                     |
|     112 | RB        | HHHTF R                  |
|     113 | RB        | RB                       |
|     115 | RB        | RB                       |
|     116 | R/RB      | HHHTF R                  |
|     117 | RB        | R/RB                     |
|     121 | RB        | F61%                     |
|     122 | RB        | HHHTF R                  |
|     125 | RB        | RB                       |
*** Splits
**** Reversal Breakouts
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHTF move this move is in"
}
$8 ~ "RB" && $3 ~ "RB" {print NR"\t"$8"\t"$3}
#+END_SRC
#+RESULTS:
| Move No | This move | HTF move this move is in |
|       3 | RB        | RB                       |
|       4 | RB        | RB                       |
|      24 | RB        | RB                       |
|      25 | RB        | RB                       |
|      33 | RB        | RB                       |
|      35 | RB        | RB                       |
|      44 | RB        | RB                       |
|      45 | RB        | RB                       |
|      47 | RB        | RB                       |
|      64 | RB/R      | RB                       |
|      65 | RB        | RB/R                     |
|      69 | RB        | RB/R                     |
|      72 | RB        | RB                       |
|      94 | RB        | RB                       |
|     102 | RB        | RB                       |
|     113 | RB        | RB                       |
|     115 | RB        | RB                       |
|     117 | RB        | R/RB                     |
|     125 | RB        | RB                       |
**** Reversals
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHTF move this move is in"
}
$8 ~ "RB" && $3 ~ /\/R|R$|\w R|R\// {print NR"\t"$8"\t"$3}
#+END_SRC
#+RESULTS:
| Move No | This move | HTF move this move is in |
|      41 | RB        | R                        |
|      65 | RB        | RB/R                     |
|      69 | RB        | RB/R                     |
|      71 | RB        | HHTF R                   |
|      88 | RB        | R                        |
|      98 | RB        | R                        |
|     101 | RB        | HHHTF R                  |
|     112 | RB        | HHHTF R                  |
|     116 | R/RB      | HHHTF R                  |
|     117 | RB        | R/RB                     |
|     122 | RB        | HHHTF R                  |
**** Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHTF move this move is in"
}
$8 ~ "RB" && $3 ~ "F[0-9]" {print NR"\t"$8"\t"$3}
#+END_SRC
#+RESULTS:
| Move No | This move | HTF move this move is in |
|       2 | RB        | F61%                     |
|      14 | RB        | F61%                     |
|      52 | RB        | F61%                     |
|      53 | RB        | F61%                     |
|      59 | RB        | F50%                     |
|      82 | RB        | F61%                     |
|     109 | R/RB      | F50%                     |
|     121 | RB        | F61%                     |

