research/reversalBreakout.html
<div id="outline-container-org9afa79c" class="outline-2">
<h2 id="org9afa79c"><span class="section-number-2">5</span> Simple Comparisons</h2>
<div class="outline-text-2" id="text-5">
<p>
This section is going to have all of the simple comparisons of a RB move with the contents of all the other relevant fields. I wont have any other factors in this sections graphs apart from &ldquo;this move&rdquo; being a RB move as well and just showing all the data in another relevant field. Hopefully this section will help spot some helpful correlations, if any.
</p>
</div>
<div id="outline-container-org8ab520d" class="outline-3">
<h3 id="org8ab520d"><span class="section-number-3">5.1</span> HTF move this move is in</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Having a RB happen on all the different types of HTF moves makes sense becasue when a new HTF move is made that means the trend on the TTF has to be reversed as a new HTF move will mean a new trend on the TTF most likely. And a trend is nothing more than a general movement in one direction with a series of higher highs and higher lows or lower highs and lower lows. Obviously this means that RB will occur as a given. What does tend to happen though when you look at the splits is that when the HTF move is in a RB itself or some sort of larger TF move, it gives teh TTF more opportunityto be able to make RB moves as the HTF is just a bigger move hence the TTF is a bigger trend with more RB moves. It would also make sense, I think, that When the HTF move is a RB move, the TTF moves will be larger in stature as they may have less of a close target or S/R to reach.
</p>

<p>
<b>Conclusion</b>
</p>
<ol class="org-ol">
<li>Gonna break down the conclusion

<ul class="org-ul">
<li>RB moves will happen in any HTF move type but more frequently in a RB HTF move it seems, or basically when the HHTF move is taking effect and the HTF move is synonymous with it</li>
<li>Basically a bigger HTF move means more of a trend for the TTF and therefore, possibly, more RB moves.</li>
</ul></li>

<li>I know that when the HTF is only having a RB or a HHTF move then that would mean that there is more opportunity to have a RB trade on the TTF also.</li>

<li>At the minute I have just said that a RB move on the HTF chart will lead to RB moves on the TTF chart without knowing what causes an RB move and when to expect it except when an RB move happens. Thats some inception timey wimey stuff right there bruv!</li>

<li>I think one thing that I can look into after thinking about this is what lines the RB move started from and what about the lines of the TF above it as well. Moves are classified basically because of what lines they abide by so another way to look at it is im trying to find out which lines will stop a move so it seems right to see which lines actually do. Especially in the conetxt of the HTF.</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">HTF move this move is in</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">RB/R</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">RB</td>
<td class="org-left">HHTF R</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">R/RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">R/RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">R/RB</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>
</tbody>
</table>
</div>
