research/reversalBreakout.org
** Direction in relation to HTF move
So this would be the case as I thought, RB only really happen at times when the TTF move is with the HTF move's direction. This is obvious I think innit because RB moves only really happen when the HTF move is going to a point that is past the TTF S/R lines. Therefore It has to be WM just in terms of logic.

What is interesting though is the distinction with a WM and a WM-FM. A WM-FM means that this move, when looked at in retrospective, was the first move on the TTF that was part of a new HTF move. Sometimes the way this can play out is by the TTF move looking at first as if it is going to be a move in the opposite direction to the current HTF move at the time but what ends up happening is it actually becomes the new HTF move and had a RB. That is the same effectively as saying the LTF reversed the TTF move by a OS-RB, if you use the current TTF as the LTF and the current HTF as the TTF. It is all relative you see. A WM-FM could also happen by a DB on the TTF leading to a TTF move that creates a new move on the HTF. /This would be an intersting thing to look at as to what moves became a WM-FM./

A WM RB means that the move was preceded by a RB in the same trend already or the HTF move has at least been shown to be a new move in a certain direction even though it hasn't caused a RB to happen on the TTF. This could happen obviously if the TTF and HTF moves were synonymous to a point and the TTF move took long enough to the point where the HTF candle got printed on the chart.

*Conclusion*
:Conclusion:
1. In general, RB moves only happen when they are WM relative to the HTF move.
2. This is the highest correlating factor that I think will be found in this study. Basically, a RB can only happen when it is following the HTF move. Not sure if this is always the case but this could mean that entering a move that is with current HTF move direction will probably result in a chance for a bigger move in general.
3.
4. I seemed to talk a lot about knowing what the context was in terms of how the previous few moves were when the RB happened, in particular in regards to a WM-FM. It would be good to know the structure of how they reversed the HTF move basically.

I would also like to know what the HTF move was that it was in possibly as well for the
:END:

#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tRelation to HTF move"
}
$8 ~ "RB" {print NR"\t"$8"\t"$4}
#+END_SRC
#+RESULTS:
| Move No | This move | Relation to HTF move |
|       2 | RB        | WM                   |
|       3 | RB        | WM                   |
|       4 | RB        | WM                   |
|      14 | RB        | WM                   |
|      24 | RB        | WM-FM                |
|      25 | RB        | WM-FM                |
|      33 | RB        | WM                   |
|      35 | RB        | WM                   |
|      41 | RB        | WM                   |
|      44 | RB        | WM                   |
|      45 | RB        | WM-FM                |
|      47 | RB        | WM                   |
|      52 | RB        | OM                   |
|      53 | RB        | WM                   |
|      59 | RB        | WM-FM                |
|      64 | RB/R      | WM                   |
|      65 | RB        | WM-FM                |
|      69 | RB        | WM                   |
|      71 | RB        | WM-FM                |
|      72 | RB        | WM-FM                |
|      82 | RB        | WM-FM                |
|      88 | RB        | WM                   |
|      94 | RB        | WM                   |
|      98 | RB        | WM-FM                |
|     101 | RB        | WM                   |
|     102 | RB        | WM-FM                |
|     109 | R/RB      | WM-FM                |
|     112 | RB        | OM                   |
|     113 | RB        | WM-FM                |
|     115 | RB        | WM                   |
|     116 | R/RB      | WM                   |
|     117 | RB        | WM-FM                |
|     121 | RB        | WM-FM                |
|     122 | RB        | WM                   |
|     125 | RB        | WM                   |
