research/reversalBreakout.html
<div id="outline-container-org7e643d6" class="outline-4">
<h4 id="org7e643d6"><span class="section-number-4">5.1.1</span> Splits</h4>
<div class="outline-text-4" id="text-5-1-1">
</div>
<ol class="org-ol">
<li><a id="org5c08507"></a>Reversal Breakouts<br />
<div class="outline-text-5" id="text-5-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">HTF move this move is in</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">RB/R</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">R/RB</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org061f37b"></a>Reversals<br />
<div class="outline-text-5" id="text-5-1-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">HTF move this move is in</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">RB</td>
<td class="org-left">HHTF R</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">R/RB</td>
<td class="org-left">HHHTF R</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">R/RB</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">RB</td>
<td class="org-left">HHHTF R</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgffd4141"></a>Fibs<br />
<div class="outline-text-5" id="text-5-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">HTF move this move is in</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">R/RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org3719e4c" class="outline-3">
<h3 id="org3719e4c"><span class="section-number-3">5.2</span> Direction in relation to HTF move</h3>
<div class="outline-text-3" id="text-5-2">
<p>
So this would be the case as I thought, RB only really happen at times when the TTF move is with the HTF move&rsquo;s direction. This is obvious I think innit because RB moves only really happen when the HTF move is going to a point that is past the TTF S/R lines. Therefore It has to be WM just in terms of logic.
</p>

<p>
What is interesting though is the distinction with a WM and a WM-FM. A WM-FM means that this move, when looked at in retrospective, was the first move on the TTF that was part of a new HTF move. Sometimes the way this can play out is by the TTF move looking at first as if it is going to be a move in the opposite direction to the current HTF move at the time but what ends up happening is it actually becomes the new HTF move and had a RB. That is the same effectively as saying the LTF reversed the TTF move by a OS-RB, if you use the current TTF as the LTF and the current HTF as the TTF. It is all relative you see. A WM-FM could also happen by a DB on the TTF leading to a TTF move that creates a new move on the HTF. <i>This would be an intersting thing to look at as to what moves became a WM-FM.</i>
</p>

<p>
A WM RB means that the move was preceded by a RB in the same trend already or the HTF move has at least been shown to be a new move in a certain direction even though it hasn&rsquo;t caused a RB to happen on the TTF. This could happen obviously if the TTF and HTF moves were synonymous to a point and the TTF move took long enough to the point where the HTF candle got printed on the chart.
</p>

<p>
<b>Conclusion</b>
</p>
<ol class="org-ol">
<li>In general, RB moves only happen when they are WM relative to the HTF move.</li>
<li>This is the highest correlating factor that I think will be found in this study. Basically, a RB can only happen when it is following the HTF move. Not sure if this is always the case but this could mean that entering a move that is with current HTF move direction will probably result in a chance for a bigger move in general.</li>
<li></li>

<li>I seemed to talk a lot about knowing what the context was in terms of how the previous few moves were when the RB happened, in particular in regards to a WM-FM. It would be good to know the structure of how they reversed the HTF move basically.</li>
</ol>

<p>
I would also like to know what the HTF move was that it was in possibly as well for the
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">Relation to HTF move</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">RB</td>
<td class="org-left">OM</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">RB/R</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">R/RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">RB</td>
<td class="org-left">OM</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">R/RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>
</tbody>
</table>
</div>
