research/reversalBreakout.org
*** Splits
**** With Move - First Move
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tRelation to HTF move"
}
$8 ~ "RB" && $4 == "WM-FM" {print NR"\t"$8"\t"$4}
#+END_SRC
#+RESULTS:
| Move No | This move | Relation to HTF move |
|      24 | RB        | WM-FM                |
|      25 | RB        | WM-FM                |
|      45 | RB        | WM-FM                |
|      59 | RB        | WM-FM                |
|      65 | RB        | WM-FM                |
|      71 | RB        | WM-FM                |
|      72 | RB        | WM-FM                |
|      82 | RB        | WM-FM                |
|      98 | RB        | WM-FM                |
|     102 | RB        | WM-FM                |
|     109 | R/RB      | WM-FM                |
|     113 | RB        | WM-FM                |
|     117 | RB        | WM-FM                |
|     121 | RB        | WM-FM                |

**** With Move
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tRelation to HTF move"
}
$8 ~ "RB" && $4 == "WM" {print NR"\t"$8"\t"$4}
#+END_SRC
#+RESULTS:
| Move No | This move | Relation to HTF move |
|       2 | RB        | WM                   |
|       3 | RB        | WM                   |
|       4 | RB        | WM                   |
|      14 | RB        | WM                   |
|      33 | RB        | WM                   |
|      35 | RB        | WM                   |
|      41 | RB        | WM                   |
|      44 | RB        | WM                   |
|      47 | RB        | WM                   |
|      53 | RB        | WM                   |
|      64 | RB/R      | WM                   |
|      69 | RB        | WM                   |
|      88 | RB        | WM                   |
|      94 | RB        | WM                   |
|     101 | RB        | WM                   |
|     115 | RB        | WM                   |
|     116 | R/RB      | WM                   |
|     122 | RB        | WM                   |
|     125 | RB        | WM                   |

**** Opposite Move
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tRelation to HTF move"
}
$8 ~ "RB" && $4 == "OM" {print NR"\t"$8"\t"$4}
#+END_SRC
#+RESULTS:
| Move No | This move | Relation to HTF move |
|      52 | RB        | OM                   |
|     112 | RB        | OM                   |

