research/reversalBreakout.org
** Previous move on this TF
Looking at the tables that I have. RB moves generally happened the most when the previous moves where either R or F in about an even split between both. One thing that just popped to my head was which one of these moves would have been a WM-FM? It would be intersting to see if there is any correlation to that. Again though the context of all of this is incredibly important. Moves are sometimes hard to classify and sometimes they are rangey where you can have multiple moves within a range and that plays a part in understanding what moves is going to happen next. Thats why I am a bit wary in trusting this section too much as it is too black or white or too small a context for my liking.
However even for what I was saying about the context and ranges and multiple moves. The analyses is the same, when does ranges happen and different contexts then. It just becomes another piece of the puzzle to figure out.

One thing I cannot deny though is the clear seperation that is found between when this type of move happens. Basically it rarely follows anything apart from R and F moves.
I think that it is normal for RB to not follow RB moves because thats a two extreme directions basically opposing eachother straight away with no build up.

Having the moves occur at after a R makes me think that it is almost looking like a classic DB or DT pattern because that is what happens. It would also be not very surprising to me if the move prior to the R in this case is generally a fib. /Something to find out I guess./
Another thing to check out is when there is a F, I think some of that is because it is already an established trend and that was a trend leg and I also think that is also because of HDB and QDB. It will be good to see that as well.

The HTF moves that happened as well are all either very close to a R move or an R move in themselves as well as a continuation of a HTF move of whatever it was. It looks like those are massive moves but they are not. I would like to know at what scenario though the RB was followed by a RB, that would be intersting.

Also one thing that has evaded me until I was telling mum about it is that ye, RB moves only really happen after a R or a F move but that also means that they never happen after a RB or a HTF move in general. This means that when you do have a RB move happen, the new move will most likely be a F or a R and brings you one step closer to figuring out when they happen and what would be a safe trade to make at that point.
A thing that I would like to know though is to look into this a little bit. When does a R or a F follow on from a RB. Also I would like to know why a RB follows on from a R and a F almost equally. How can I know in what situation the precursor R and F produces a RB.

*Conclusion*
:Conclusion:
1. Things that I have found:
   - The precursor to RB moves are normally only R and F moves.
   - Only rarely is a RB followed by an RB
2. How it fits with what im looking for:
   - Expect a with current HTF move new TTF move to posibbly be a RB if the precursor is a F or a R
   - When an RB move occurs then the move after that, you know, will most likely be a F or a R
3. :
   - I dont know exactly how to describe this but basically this thing is a bit too simplistic to be able to just have a previous move, possibly at least in my opinion. The few moves prior in terms of how it looks and moves I think needs to be taken into context too.
   - After a RB there is generally either a F or R move. That might be something that you can use for reasearching when those move happen.
4. Further points of study:
   - If I added a FM-WM filter and printed a few more fields to this query what would return? This will help also with knowing why the RB moves followed the RB moves as they would all show up in that query.
   - RB moves that occured after a R and F remind me of the second leg of a DT or HDT structure. Is this true?
:END:

#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move"
}
$8 ~ "RB" {print NR"\t"$8"\t"$5}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move    |
|       2 | RB        | R                |
|       3 | RB        | R/HHTF F38%      |
|       4 | RB        | R                |
|      14 | RB        | R                |
|      24 | RB        | F61%             |
|      25 | RB        | R/HTF F61%       |
|      33 | RB        | F61%             |
|      35 | RB        | F50%             |
|      41 | RB        | R                |
|      44 | RB        | R                |
|      45 | RB        | R                |
|      47 | RB        | F61%             |
|      52 | RB        | F38%             |
|      53 | RB        | RB               |
|      59 | RB        | revesal breakout |
|      64 | RB/R      | R                |
|      65 | RB        | F61%             |
|      69 | RB        | R                |
|      71 | RB        | RB/R             |
|      72 | RB        | RB               |
|      82 | RB        | F61%             |
|      88 | RB        | F61%             |
|      94 | RB        | R                |
|      98 | RB        | R                |
|     101 | RB        | R                |
|     102 | RB        | F61%             |
|     109 | R/RB      | R                |
|     112 | RB        | F50%             |
|     113 | RB        | R                |
|     115 | RB        | F50%             |
|     116 | R/RB      | RB               |
|     117 | RB        | RB               |
|     121 | RB        | HTF R            |
|     122 | RB        | F61%             |
|     125 | RB        | F50%             |
