research/reversalBreakout.html
<div id="outline-container-orgabbbb35" class="outline-4">
<h4 id="orgabbbb35"><span class="section-number-4">5.2.1</span> Splits</h4>
<div class="outline-text-4" id="text-5-2-1">
</div>
<ol class="org-ol">
<li><a id="org7a0c7bd"></a>With Move - First Move<br />
<div class="outline-text-5" id="text-5-2-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">Relation to HTF move</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">R/RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">RB</td>
<td class="org-left">WM-FM</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org6918f50"></a>With Move<br />
<div class="outline-text-5" id="text-5-2-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">Relation to HTF move</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">RB/R</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">R/RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">RB</td>
<td class="org-left">WM</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="orga80b207"></a>Opposite Move<br />
<div class="outline-text-5" id="text-5-2-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">Relation to HTF move</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">RB</td>
<td class="org-left">OM</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">RB</td>
<td class="org-left">OM</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org47bc9ea" class="outline-3">
<h3 id="org47bc9ea"><span class="section-number-3">5.3</span> Previous move on this TF</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Looking at the tables that I have. RB moves generally happened the most when the previous moves where either R or F in about an even split between both. One thing that just popped to my head was which one of these moves would have been a WM-FM? It would be intersting to see if there is any correlation to that. Again though the context of all of this is incredibly important. Moves are sometimes hard to classify and sometimes they are rangey where you can have multiple moves within a range and that plays a part in understanding what moves is going to happen next. Thats why I am a bit wary in trusting this section too much as it is too black or white or too small a context for my liking.
However even for what I was saying about the context and ranges and multiple moves. The analyses is the same, when does ranges happen and different contexts then. It just becomes another piece of the puzzle to figure out.
</p>

<p>
One thing I cannot deny though is the clear seperation that is found between when this type of move happens. Basically it rarely follows anything apart from R and F moves.
I think that it is normal for RB to not follow RB moves because thats a two extreme directions basically opposing eachother straight away with no build up.
</p>

<p>
Having the moves occur at after a R makes me think that it is almost looking like a classic DB or DT pattern because that is what happens. It would also be not very surprising to me if the move prior to the R in this case is generally a fib. <i>Something to find out I guess.</i>
Another thing to check out is when there is a F, I think some of that is because it is already an established trend and that was a trend leg and I also think that is also because of HDB and QDB. It will be good to see that as well.
</p>

<p>
The HTF moves that happened as well are all either very close to a R move or an R move in themselves as well as a continuation of a HTF move of whatever it was. It looks like those are massive moves but they are not. I would like to know at what scenario though the RB was followed by a RB, that would be intersting.
</p>

<p>
Also one thing that has evaded me until I was telling mum about it is that ye, RB moves only really happen after a R or a F move but that also means that they never happen after a RB or a HTF move in general. This means that when you do have a RB move happen, the new move will most likely be a F or a R and brings you one step closer to figuring out when they happen and what would be a safe trade to make at that point.
A thing that I would like to know though is to look into this a little bit. When does a R or a F follow on from a RB. Also I would like to know why a RB follows on from a R and a F almost equally. How can I know in what situation the precursor R and F produces a RB.
</p>

<p>
<b>Conclusion</b>
</p>
<ol class="org-ol">
<li>Things that I have found:
<ul class="org-ul">
<li>The precursor to RB moves are normally only R and F moves.</li>
<li>Only rarely is a RB followed by an RB meaning when an RB move occurs then the nove after that, you know, will most likely be a F or a R</li>
</ul></li>
<li></li>

<li></li>

<li></li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Move No</td>
<td class="org-left">This move</td>
<td class="org-left">Previous move</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">RB</td>
<td class="org-left">R/HHTF F38%</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">RB</td>
<td class="org-left">R/HTF F61%</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">RB</td>
<td class="org-left">F38%</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">RB</td>
<td class="org-left">revesal breakout</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">RB/R</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">RB</td>
<td class="org-left">RB/R</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">88</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">94</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">98</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">102</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">109</td>
<td class="org-left">R/RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">112</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">113</td>
<td class="org-left">RB</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">115</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>

<tr>
<td class="org-right">116</td>
<td class="org-left">R/RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">117</td>
<td class="org-left">RB</td>
<td class="org-left">RB</td>
</tr>

<tr>
<td class="org-right">121</td>
<td class="org-left">RB</td>
<td class="org-left">HTF R</td>
</tr>

<tr>
<td class="org-right">122</td>
<td class="org-left">RB</td>
<td class="org-left">F61%</td>
</tr>

<tr>
<td class="org-right">125</td>
<td class="org-left">RB</td>
<td class="org-left">F50%</td>
</tr>
</tbody>
</table>
</div>
