research/reversalBreakout.org
*** Splits
**** Reversal Breakout
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move"
}
$8 ~ "RB" && $5 ~ "RB" {print NR"\t"$8"\t"$5}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move |
|      53 | RB        | RB            |
|      71 | RB        | RB/R          |
|      72 | RB        | RB            |
|     116 | R/RB      | RB            |
|     117 | RB        | RB            |
**** Reversal
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move"
}
$8 ~ "RB" && $5 ~ /\/R|R$|\w R|R\// {print NR"\t"$8"\t"$5}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move |
|       2 | RB        | R             |
|       3 | RB        | R/HHTF F38%   |
|       4 | RB        | R             |
|      14 | RB        | R             |
|      25 | RB        | R/HTF F61%    |
|      41 | RB        | R             |
|      44 | RB        | R             |
|      45 | RB        | R             |
|      64 | RB/R      | R             |
|      69 | RB        | R             |
|      71 | RB        | RB/R          |
|      94 | RB        | R             |
|      98 | RB        | R             |
|     101 | RB        | R             |
|     109 | R/RB      | R             |
|     113 | RB        | R             |
|     121 | RB        | HTF R         |
**** HTF Moves
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move"
}
$8 ~ "RB" && $5 ~ "H" {print NR"\t"$8"\t"$5}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move |
|       3 | RB        | R/HHTF F38%   |
|      25 | RB        | R/HTF F61%    |
|     121 | RB        | HTF R         |
**** Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move"
}
$8 ~ "RB" && $5 ~ "F[0-9]" {print NR"\t"$8"\t"$5}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move |
|       3 | RB        | R/HHTF F38%   |
|      24 | RB        | F61%          |
|      25 | RB        | R/HTF F61%    |
|      33 | RB        | F61%          |
|      35 | RB        | F50%          |
|      47 | RB        | F61%          |
|      52 | RB        | F38%          |
|      65 | RB        | F61%          |
|      82 | RB        | F61%          |
|      88 | RB        | F61%          |
|     102 | RB        | F61%          |
|     112 | RB        | F50%          |
|     115 | RB        | F50%          |
|     122 | RB        | F61%          |
|     125 | RB        | F50%          |
** Line the previous move started from
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine previous move began from"
}
$8 ~ "RB" {print NR"\t"$1"\t"$8"\t"$6}
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line previous move began from |
|       2 | HHTF    | RB        | HTF SS                        |
|       3 | HTF     | RB        | HHHHTF RR/HHTF RR/HTF RR      |
|       4 | TTF     | RB        | F38%                          |
|      14 | TTF     | RB        | SS/HTF F38%                   |
|      24 | HTF     | RB        | HHTF F38%/HTF F61%            |
|      25 | TTF     | RB        | F50%                          |
|      33 | TTF     | RB        | F61%                          |
|      35 | TTF     | RB        | SS                            |
|      41 | TTF     | RB        | HTF SS/HHTF SS/HHHTF F50%     |
|      44 | HTF     | RB        | HTF SS                        |
|      45 | TTF     | RB        | SS                            |
|      47 | TTF     | RB        | SS/HTF SS                     |
|      52 | TTF     | RB        | F38%/HTF F38%                 |
|      53 | TTF     | RB        | F38%                          |
|      59 | TTF     | RB        | RR                            |
|      64 | HTF     | RB/R      | F50%                          |
|      65 | TTF     | RB        | F61%/HTF SS                   |
|      69 | TTF     | RB        | SS/HTF SS                     |
|      71 | HTF     | RB        | HTF F61%/HTF RR               |
|      72 | TTF     | RB        | RR                            |
|      82 | TTF     | RB        | F38%                          |
|      88 | TTF     | RB        | F50/%HTF F38%                 |
|      94 | TTF     | RB        | RR                            |
|      98 | TTF     | RB        | F50%                          |
|     101 | HTF     | RB        | HTF RR at HHTF F38%           |
|     102 | TTF     | RB        | HTF RR                        |
|     109 | TTF     | R/RB      | F50%                          |
|     112 | HTF     | RB        | F61%                          |
|     113 | TTF     | RB        | HTF SS/SS                     |
|     115 | TTF     | RB        | SS undershooting HTF SS       |
|     116 | HTF     | R/RB      | F50%                          |
|     117 | TTF     | RB        | F50%                          |
|     121 | TTF     | RB        | F50%/HTF F50%                 |
|     122 | HTF     | RB        | HTF RR                        |
|     125 | TTF     | RB        | RR at HTF F61%                |
*** Splits
**** TTF S/R
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine previous move began from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $6 ~ /H\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$6}
    else if ($1 == "TTF" && $8 ~ "RB" && $6 ~ /^[SS|RR]|[SS|RR] /) {print NR"\t"$1"\t"$8"\t"$6}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line previous move began from |
|       2 | HHTF    | RB        | HTF SS                        |
|       3 | HTF     | RB        | HHHHTF RR/HHTF RR/HTF RR      |
|      14 | TTF     | RB        | SS/HTF F38%                   |
|      35 | TTF     | RB        | SS                            |
|      44 | HTF     | RB        | HTF SS                        |
|      45 | TTF     | RB        | SS                            |
|      47 | TTF     | RB        | SS/HTF SS                     |
|      59 | TTF     | RB        | RR                            |
|      69 | TTF     | RB        | SS/HTF SS                     |
|      71 | HTF     | RB        | HTF F61%/HTF RR               |
|      72 | TTF     | RB        | RR                            |
|      94 | TTF     | RB        | RR                            |
|     101 | HTF     | RB        | HTF RR at HHTF F38%           |
|     115 | TTF     | RB        | SS undershooting HTF SS       |
|     122 | HTF     | RB        | HTF RR                        |
|     125 | TTF     | RB        | RR at HTF F61%                |

**** TTF Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine previous move began from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $6 ~ /F[0-9]/) {print NR"\t"$1"\t"$8"\t"$6}
    else if ($1 == "TTF" && $8 ~ "RB" && $6 ~ /^F[0-9].%/) {print NR"\t"$1"\t"$8"\t"$6}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line previous move began from |
|       4 | TTF     | RB        | F38%                          |
|      24 | HTF     | RB        | HHTF F38%/HTF F61%            |
|      25 | TTF     | RB        | F50%                          |
|      33 | TTF     | RB        | F61%                          |
|      52 | TTF     | RB        | F38%/HTF F38%                 |
|      53 | TTF     | RB        | F38%                          |
|      64 | HTF     | RB/R      | F50%                          |
|      65 | TTF     | RB        | F61%/HTF SS                   |
|      71 | HTF     | RB        | HTF F61%/HTF RR               |
|      82 | TTF     | RB        | F38%                          |
|      98 | TTF     | RB        | F50%                          |
|     101 | HTF     | RB        | HTF RR at HHTF F38%           |
|     109 | TTF     | R/RB      | F50%                          |
|     112 | HTF     | RB        | F61%                          |
|     116 | HTF     | R/RB      | F50%                          |
|     117 | TTF     | RB        | F50%                          |
|     121 | TTF     | RB        | F50%/HTF F50%                 |

**** H(n)TF S/R
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine previous move began from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $6 ~ /HH\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$6}
    else if ($1 == "TTF" && $8 ~ "RB" && $6 ~ /H\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$6}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line previous move began from |
|       3 | HTF     | RB        | HHHHTF RR/HHTF RR/HTF RR      |
|      41 | TTF     | RB        | HTF SS/HHTF SS/HHHTF F50%     |
|      47 | TTF     | RB        | SS/HTF SS                     |
|      65 | TTF     | RB        | F61%/HTF SS                   |
|      69 | TTF     | RB        | SS/HTF SS                     |
|     102 | TTF     | RB        | HTF RR                        |
|     113 | TTF     | RB        | HTF SS/SS                     |
|     115 | TTF     | RB        | SS undershooting HTF SS       |

**** H(n)TF Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine previous move began from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $6 ~ /HH\w* F[0-9]/) {print NR"\t"$1"\t"$8"\t"$6}
    else if ($1 == "TTF" && $8 ~ "RB" && $6 ~ /F F[0-9].%/) {print NR"\t"$1"\t"$8"\t"$9}
    }
#+END_SRC

#+RESULTS:
| Move No | Move TF | This move | Line previous move began from    |
|      14 | TTF     | RB        | RR                               |
|      24 | HTF     | RB        | HHTF F38%/HTF F61%               |
|      41 | TTF     | RB        | HTF F50%/F50% - synonymous moves |
|      52 | TTF     | RB        | F38%                             |
|      88 | TTF     | RB        | F61%                             |
|     101 | HTF     | RB        | HTF RR at HHTF F38%              |
|     121 | TTF     | RB        | HTF RR                           |
|     125 | TTF     | RB        | F50%                             |

