research/reversalBreakout.org
*** Splits
**** No
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move over/undershoot"
}
$8 ~ "RB" && $7 ~ /^no$|^no -/ {print NR"\t"$8"\t"$7}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move over/undershoot |
|       2 | RB        | no                            |
|       4 | RB        | no                            |
|      14 | RB        | no                            |
|      35 | RB        | no                            |
|      44 | RB        | no                            |
|      45 | RB        | no                            |
|      47 | RB        | no                            |
|      52 | RB        | no                            |
|      53 | RB        | no                            |
|      59 | RB        | no                            |
|      69 | RB        | no                            |
|      82 | RB        | no                            |
|      94 | RB        | no                            |
|      98 | RB        | no                            |
|     109 | R/RB      | no                            |
|     112 | RB        | no                            |
|     113 | RB        | no                            |
|     116 | R/RB      | no                            |
|     117 | RB        | no                            |

**** Yes
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move over/undershoot"
}
$8 ~ "RB" && $7 ~ /^yes$|^yes -/ {print NR"\t"$8"\t"$7}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move over/undershoot                                                             |
|       3 | RB        | yes - it slightly overshot the HTF RR furthest line and the HHTF and HHHHTF closest lines |
|      25 | RB        | yes - slighlty overshot                                                                   |
|      33 | RB        | yes - slightly overshot                                                                   |
|      64 | RB/R      | yes - slighlty undershot                                                                  |
|      65 | RB        | yes - overshot bothe the F line and the closest HTF SS line                               |
|      71 | RB        | yes - overshot                                                                            |
|      72 | RB        | yes - slightly overshot the farthest line and went into the F61% level                    |
|      88 | RB        | yes - overshot                                                                            |
|     102 | RB        | yes - undershot                                                                           |
|     121 | RB        | yes - slightly overshot                                                                   |

**** No/Yes
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tPrevious move over/undershoot"
}
$8 ~ "RB" && $7 ~ /^no\/yes/ {print NR"\t"$8"\t"$7}
#+END_SRC
#+RESULTS:
| Move No | This move | Previous move over/undershoot                                                                             |
|      24 | RB        | no/yes - it slightly overshot the HTF F by a little bit but the HHTF F it was pretty much spot on         |
|      41 | RB        | no/yes - overshot the HHTF SS closest line by a bit but overall was not overshooting the HTF by very much |
|     101 | RB        | no/yes - overshot the HHTF F38% by a bit and was in the middle of the HTF RR area                         |
|     115 | RB        | no/yes - undershot slighlty the HTF SS closest line                                                       |
|     122 | RB        | no/yes - it overshot the first HTF resisatnce area but not the second                                     |
|     125 | RB        | no/yes - slighlty overshot the HTF F61%                                                                   |

