research/reversalBreakout.org
** What line did this move start from
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine this move started from"
}
$8 ~ "RB" {print NR"\t"$1"\t"$8"\t"$9}
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line this move started from        |
|       2 | HHTF    | RB        | HTF SS                             |
|       3 | HTF     | RB        | HTF SS/HHTF F38%                   |
|       4 | TTF     | RB        | SS                                 |
|      14 | TTF     | RB        | RR                                 |
|      24 | HTF     | RB        | F61%                               |
|      25 | TTF     | RB        | HTF F61%/RR                        |
|      33 | TTF     | RB        | F61%                               |
|      35 | TTF     | RB        | F50%                               |
|      41 | TTF     | RB        | HTF F50%/F50% - synonymous moves   |
|      44 | HTF     | RB        | RR/HHTF F23%                       |
|      45 | TTF     | RB        | RR                                 |
|      47 | TTF     | RB        | F61%                               |
|      52 | TTF     | RB        | F38%                               |
|      53 | TTF     | RB        | HTF F50%                           |
|      59 | TTF     | RB        | RR/HTF RR/HTF F61%                 |
|      64 | HTF     | RB/R      | HTF F61%/HTF RR                    |
|      65 | TTF     | RB        | F61%                               |
|      69 | TTF     | RB        | RR                                 |
|      71 | HTF     | RB        | HTF SS                             |
|      72 | TTF     | RB        | HTF SS                             |
|      82 | TTF     | RB        | F61%                               |
|      88 | TTF     | RB        | F61%                               |
|      94 | TTF     | RB        | SS/HTF F50%                        |
|      98 | TTF     | RB        | RR                                 |
|     101 | HTF     | RB        | HTF SS                             |
|     102 | TTF     | RB        | F61%                               |
|     109 | TTF     | R/RB      | SS/HTF SS                          |
|     112 | HTF     | RB        | F50%                               |
|     113 | TTF     | RB        | HTF F50%                           |
|     115 | TTF     | RB        | F50%                               |
|     116 | HTF     | R/RB      | HHTF F61%/HTF SS                   |
|     117 | TTF     | RB        | SS within HTF SS area at HHTF F61% |
|     121 | TTF     | RB        | HTF RR                             |
|     122 | HTF     | RB        | F61%                               |
|     125 | TTF     | RB        | F50%                               |
*** Splits
**** TTF S/R
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine this move started from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $9 ~ /H\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$9}
    else if ($1 == "TTF" && $8 ~ "RB" && $9 ~ /^[SS|RR]|[SS|RR] /) {print NR"\t"$1"\t"$8"\t"$9}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line this move started from        |
|       2 | HHTF    | RB        | HTF SS                             |
|       3 | HTF     | RB        | HTF SS/HHTF F38%                   |
|       4 | TTF     | RB        | SS                                 |
|      14 | TTF     | RB        | RR                                 |
|      45 | TTF     | RB        | RR                                 |
|      59 | TTF     | RB        | RR/HTF RR/HTF F61%                 |
|      64 | HTF     | RB/R      | HTF F61%/HTF RR                    |
|      69 | TTF     | RB        | RR                                 |
|      71 | HTF     | RB        | HTF SS                             |
|      94 | TTF     | RB        | SS/HTF F50%                        |
|      98 | TTF     | RB        | RR                                 |
|     101 | HTF     | RB        | HTF SS                             |
|     109 | TTF     | R/RB      | SS/HTF SS                          |
|     116 | HTF     | R/RB      | HHTF F61%/HTF SS                   |
|     117 | TTF     | RB        | SS within HTF SS area at HHTF F61% |

