research/reversalBreakout.org
**** TTF Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine this move started from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $9 ~ /F[0-9]/) {print NR"\t"$1"\t"$8"\t"$9}
    else if ($1 == "TTF" && $8 ~ "RB" && $9 ~ /^F[0-9].%/) {print NR"\t"$1"\t"$8"\t"$9}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line this move started from |
|       3 | HTF     | RB        | HTF SS/HHTF F38%            |
|      24 | HTF     | RB        | F61%                        |
|      33 | TTF     | RB        | F61%                        |
|      35 | TTF     | RB        | F50%                        |
|      44 | HTF     | RB        | RR/HHTF F23%                |
|      47 | TTF     | RB        | F61%                        |
|      52 | TTF     | RB        | F38%                        |
|      64 | HTF     | RB/R      | HTF F61%/HTF RR             |
|      65 | TTF     | RB        | F61%                        |
|      82 | TTF     | RB        | F61%                        |
|      88 | TTF     | RB        | F61%                        |
|     102 | TTF     | RB        | F61%                        |
|     112 | HTF     | RB        | F50%                        |
|     115 | TTF     | RB        | F50%                        |
|     116 | HTF     | R/RB      | HHTF F61%/HTF SS            |
|     122 | HTF     | RB        | F61%                        |
|     125 | TTF     | RB        | F50%                        |

**** H(n)TF S/R
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine this move started from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $9 ~ /HH\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$9}
    else if ($1 == "TTF" && $8 ~ "RB" && $9 ~ /H\w* [SS|RR]/) {print NR"\t"$1"\t"$8"\t"$9}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line this move started from        |
|      59 | TTF     | RB        | RR/HTF RR/HTF F61%                 |
|      72 | TTF     | RB        | HTF SS                             |
|     109 | TTF     | R/RB      | SS/HTF SS                          |
|     117 | TTF     | RB        | SS within HTF SS area at HHTF F61% |
|     121 | TTF     | RB        | HTF RR                             |

**** H(n)TF Fibs
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tMove TF\tThis move\tLine this move started from"
}
{if ($1 ~ /H\w*/ && $8 ~ "RB" && $9 ~ /HH\w* F[0-9]/) {print NR"\t"$1"\t"$8"\t"$9}
    else if ($1 == "TTF" && $8 ~ "RB" && $9 ~ /F F[0-9].%/) {print NR"\t"$1"\t"$8"\t"$9}
    }
#+END_SRC
#+RESULTS:
| Move No | Move TF | This move | Line this move started from        |
|       3 | HTF     | RB        | HTF SS/HHTF F38%                   |
|      25 | TTF     | RB        | HTF F61%/RR                        |
|      41 | TTF     | RB        | HTF F50%/F50% - synonymous moves   |
|      44 | HTF     | RB        | RR/HHTF F23%                       |
|      53 | TTF     | RB        | HTF F50%                           |
|      59 | TTF     | RB        | RR/HTF RR/HTF F61%                 |
|      94 | TTF     | RB        | SS/HTF F50%                        |
|     113 | TTF     | RB        | HTF F50%                           |
|     116 | HTF     | R/RB      | HHTF F61%/HTF SS                   |
|     117 | TTF     | RB        | SS within HTF SS area at HHTF F61% |

** Did the start of this move overshoot or undershoot
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tThis move over/undershoot?"
}
$8 ~ "RB" {print NR"\t"$8"\t"$10}
#+END_SRC
#+RESULTS:
| Move No | This move | This move over/undershoot?                                              |
|       2 | RB        | yes - slighlty overshot                                                 |
|       3 | RB        | yes - overshot the HTF SS by a bit as well as the HTF F by a little too |
|       4 | RB        | no                                                                      |
|      14 | RB        | no                                                                      |
|      24 | RB        | no                                                                      |
|      25 | RB        | no                                                                      |
|      33 | RB        | no                                                                      |
|      35 | RB        | no                                                                      |
|      41 | RB        | no                                                                      |
|      44 | RB        | no/yes - it did not overshoot the RR but it did overshoot the HHTF F    |
|      45 | RB        | no                                                                      |
|      47 | RB        | no                                                                      |
|      52 | RB        | no                                                                      |
|      53 | RB        | yes - overshot the F50% by quite a bit                                  |
|      59 | RB        | no/yes - did not over or undershoot anything except the HTF F61%        |
|      64 | RB/R      | yes - overshot                                                          |
|      65 | RB        | no                                                                      |
|      69 | RB        | yes - slightly overshot the farthest line and went into the F61% level  |
|      71 | RB        | no                                                                      |
|      72 | RB        | no                                                                      |
|      82 | RB        | no                                                                      |
|      88 | RB        | yes - overshot                                                          |
|      94 | RB        | no/yes - slighlty undershot the HTF F50%                                |
|      98 | RB        | no                                                                      |
|     101 | RB        | no                                                                      |
|     102 | RB        | yes - slightly overshot                                                 |
|     109 | R/RB      | no                                                                      |
|     112 | RB        | no                                                                      |
|     113 | RB        | no                                                                      |
|     115 | RB        | no                                                                      |
|     116 | R/RB      | no                                                                      |
|     117 | RB        | no                                                                      |
|     121 | RB        | no                                                                      |
|     122 | RB        | yes - slightly undershot                                                |
|     125 | RB        | no                                                                      |

*** Splits
**** No
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tDid this move over/undershoot"
}
$8 ~ "RB" && $10 ~ /^no$|^no -/ {print NR"\t"$8"\t"$10}
#+END_SRC
#+RESULTS:
| Move No | This move | Did this move over/undershoot |
|       4 | RB        | no                            |
|      14 | RB        | no                            |
|      24 | RB        | no                            |
|      25 | RB        | no                            |
|      33 | RB        | no                            |
|      35 | RB        | no                            |
|      41 | RB        | no                            |
|      45 | RB        | no                            |
|      47 | RB        | no                            |
|      52 | RB        | no                            |
|      65 | RB        | no                            |
|      71 | RB        | no                            |
|      72 | RB        | no                            |
|      82 | RB        | no                            |
|      98 | RB        | no                            |
|     101 | RB        | no                            |
|     109 | R/RB      | no                            |
|     112 | RB        | no                            |
|     113 | RB        | no                            |
|     115 | RB        | no                            |
|     116 | R/RB      | no                            |
|     117 | RB        | no                            |
|     121 | RB        | no                            |
|     125 | RB        | no                            |

**** Yes
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tDid this move over/undershoot"
}
$8 ~ "RB" && $10 ~ /^yes$|^yes -/ {print NR"\t"$8"\t"$10}
#+END_SRC
#+RESULTS:
| Move No | This move | Did this move over/undershoot                                           |
|       2 | RB        | yes - slighlty overshot                                                 |
|       3 | RB        | yes - overshot the HTF SS by a bit as well as the HTF F by a little too |
|      53 | RB        | yes - overshot the F50% by quite a bit                                  |
|      64 | RB/R      | yes - overshot                                                          |
|      69 | RB        | yes - slightly overshot the farthest line and went into the F61% level  |
|      88 | RB        | yes - overshot                                                          |
|     102 | RB        | yes - slightly overshot                                                 |
|     122 | RB        | yes - slightly undershot                                                |

**** No/Yes
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tDid this move over/undershoot"
}
$8 ~ "RB" && $10 ~ /^no\/yes/ {print NR"\t"$8"\t"$10}
#+END_SRC
#+RESULTS:
| Move No | This move | Did this move over/undershoot                                        |
|      44 | RB        | no/yes - it did not overshoot the RR but it did overshoot the HHTF F |
|      59 | RB        | no/yes - did not over or undershoot anything except the HTF F61%     |
|      94 | RB        | no/yes - slighlty undershot the HTF F50%                             |

