research/reversalBreakout.org
** How did the start of this move reverse on the LTF
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse?                               |
|       2 | RB        | HDB                                                                   |
|       3 | RB        | DB                                                                    |
|       4 | RB        | DB - the second down leg made a RB move                               |
|      14 | RB        | HDT - first move was a R followed by F then RB                        |
|      24 | RB        | DT - multiple swings                                                  |
|      25 | RB        | HDT                                                                   |
|      33 | RB        | OS - RB                                                               |
|      35 | RB        | DT - slow swing and very small swings as well                         |
|      41 | RB        | HDB - multiple swings                                                 |
|      44 | RB        | DT                                                                    |
|      45 | RB        | DT                                                                    |
|      47 | RB        | HDT                                                                   |
|      52 | RB        | OS - RB                                                               |
|      53 | RB        | OS - RB                                                               |
|      59 | RB        | QDT                                                                   |
|      64 | RB/R      | HDT                                                                   |
|      65 | RB        | HDT                                                                   |
|      69 | RB        | DT                                                                    |
|      71 | RB        | OS - had a little mini move on the TTF but it was basically a RB move |
|      72 | RB        | HDB                                                                   |
|      82 | RB        | OS - RB                                                               |
|      88 | RB        | DT                                                                    |
|      94 | RB        | DB                                                                    |
|      98 | RB        | QDT                                                                   |
|     101 | RB        | HDB                                                                   |
|     102 | RB        | OS - R                                                                |
|     109 | R/RB      | OS - R                                                                |
|     112 | RB        | DT                                                                    |
|     113 | RB        | DT                                                                    |
|     115 | RB        | DT                                                                    |
|     116 | R/RB      | OS - R                                                                |
|     117 | RB        | OS - RB                                                               |
|     121 | RB        | HDT                                                                   |
|     122 | RB        | QDB                                                                   |
|     125 | RB        | OS - RB                                                               |
