research/reversalBreakout.org
*** Splits
**** One Swing
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^OS/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse?                               |
|      33 | RB        | OS - RB                                                               |
|      52 | RB        | OS - RB                                                               |
|      53 | RB        | OS - RB                                                               |
|      71 | RB        | OS - had a little mini move on the TTF but it was basically a RB move |
|      82 | RB        | OS - RB                                                               |
|     102 | RB        | OS - R                                                                |
|     109 | R/RB      | OS - R                                                                |
|     116 | R/RB      | OS - R                                                                |
|     117 | RB        | OS - RB                                                               |
|     125 | RB        | OS - RB                                                               |

**** Double Top
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^DT/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse?       |
|      24 | RB        | DT - multiple swings                          |
|      35 | RB        | DT - slow swing and very small swings as well |
|      44 | RB        | DT                                            |
|      45 | RB        | DT                                            |
|      69 | RB        | DT                                            |
|      88 | RB        | DT                                            |
|     112 | RB        | DT                                            |
|     113 | RB        | DT                                            |
|     115 | RB        | DT                                            |

***** Half Double Top
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^HDT/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse?        |
|      14 | RB        | HDT - first move was a R followed by F then RB |
|      25 | RB        | HDT                                            |
|      47 | RB        | HDT                                            |
|      64 | RB/R      | HDT                                            |
|      65 | RB        | HDT                                            |
|     121 | RB        | HDT                                            |

***** Quarter Double Top
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^QDT/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse? |
|      59 | RB        | QDT                                     |
|      98 | RB        | QDT                                     |

**** Double Bottom
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^DB/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse? |
|       3 | RB        | DB                                      |
|       4 | RB        | DB - the second down leg made a RB move |
|      94 | RB        | DB                                      |

***** Half Double Bottom
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^HDB/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse? |
|       2 | RB        | HDB                                     |
|      41 | RB        | HDB - multiple swings                   |
|      72 | RB        | HDB                                     |
|     101 | RB        | HDB                                     |

***** Quarter Double Bottom
#+BEGIN_SRC awk :in-file ../08_10_2020.csv :exports results
BEGIN {
    FS=","
    print "Move No\tThis move\tHow did the start of this move reverse?"
}
$8 ~ "RB" && $11 ~ /^QDB/ {print NR"\t"$8"\t"$11}
#+END_SRC
#+RESULTS:
| Move No | This move | How did the start of this move reverse? |
|     122 | RB        | QDB                                     |
